README.org
#+property: header-args :tangle "init.el"

* Emacs Initialization  
** Custom File
#+begin_src emacs-lisp
(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(load custom-file :no-error-if-file-is-missing)
#+end_src
** Backup Files
Standardize the location of all backup files, rather than polluting the working directory
#+begin_src emacs-lisp
(setq backup-directory-alist
      '((".*" . "~/.emacs.d/backups/")))
#+end_src
** History
#+begin_src emacs-lisp
  (use-package savehist
    :config
    (savehist-mode))

  (recentf-mode 1)
#+end_src
** Package Manager
Setup [[https://github.com/radian-software/straight.el][straight.el]] as the package manager
#+begin_src emacs-lisp
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name
          "straight/repos/straight.el/bootstrap.el"
          (or (bound-and-true-p straight-base-dir)
              user-emacs-directory)))
        (bootstrap-version 7))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  (straight-use-package 'use-package)
#+end_src
** Visual Tweaks
*** Minimal defaults
Disable the tool bar, menu bar, scroll bar, and splash screen
#+begin_src emacs-lisp
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (setq-default inhibit-splash-screen t)
  (setq-default cursor-type 'bar)
#+end_src
**** Disable Warning Popup
The warnings buffer is super nice so I prefer not to limit warnings to errors, but rather just prevent it from automatically popping up
#+begin_src emacs-lisp
  (add-to-list 'display-buffer-alist
               '("\\`\\*\\(Warnings\\|Compile-Log\\)\\*\\'"
                 (display-buffer-no-window)
                 (allow-no-window . t)))
#+end_src
*** Font
#+begin_src emacs-lisp
  (set-face-attribute 'default nil :font "ComicShannsMono Nerd Font Mono" :height 120)
#+end_src
*** Scrolling
Set a scrolling offset and disable the ensure emacs does not recenter the view when scrolling
#+begin_src emacs-lisp
  (pixel-scroll-precision-mode 1)
  (setq scroll-margin 5
        scroll-step 1
        scroll-conservatively 10000
        scroll-preserve-screen-position 1)
#+end_src
*** Relative Line Numbers
#+begin_src emacs-lisp
  (setq display-line-numbers-type 'relative)
#+end_src
*** Modeline
#+begin_src emacs-lisp
  (use-package doom-modeline
    :straight t
    :after nerd-icons
    :init
    (doom-modeline-mode 1)
    (display-time-mode t)
    :config
    (setq doom-modeline-project-detection 'auto
  	       doom-modeline-icon t
  	       doom-modeline-analogue-clock nil
  	       doom-modeline-lsp-icon t
  	       doom-modeline-modal t
  	       doom-modeline-modal-modern-icon t))
#+end_src
*** Themes
I only really use ef-themes, but it doesn't hurt to have a few more options for a little change of pace
**** ef-themes
Truly amazing themes. ef-autumn is my all-time favorite theme
#+begin_src emacs-lisp
  (use-package ef-themes
    :straight t
    :config
    (setq ef-themes-to-toggle '(ef-autumn ef-melissa-light))
    (ef-themes-select 'ef-autumn))
#+end_src
**** catppuccin
#+begin_src emacs-lisp
  (use-package catppuccin-theme
    :straight t
    :defer t)
#+end_src
**** cyberpunk
#+begin_src emacs-lisp
  (use-package cyberpunk-theme
    :straight t
    :defer t)
#+end_src
**** doom-themes
#+begin_src emacs-lisp
  (use-package doom-themes
    :straight t
    :defer t)
#+end_src
**** gruber-darker
#+begin_src emacs-lisp
  (use-package gruber-darker-theme
    :straight t
    :defer t)
#+end_src
*** Nerd Icons
#+begin_src emacs-lisp
  (use-package nerd-icons
    :straight t
    :config
    (setq nerd-icons-scale-factor 1.1
  	nerd-icons-font-family "ComicShannsMono Nerd Font Mono"))
#+end_src
**** Completion
#+begin_src emacs-lisp
  (use-package nerd-icons-completion
    :straight t
    :after (nerd-icons marginalia)
    :config
    (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup))
#+end_src
**** Dired
#+begin_src emacs-lisp
  (use-package nerd-icons-dired
    :straight t
    :after nerd-icons
    :hook
    (dired-mode . nerd-icons-dired-mode))
#+end_src
** Dired
Customize dired. Allow
#+begin_src emacs-lisp
  (use-package dired
    :hook
    (dired-mode . openwith-mode)
    :config
    (setq dired-auto-revert-buffer #'dired-directory-changed-p
  	dired-free-space nil
  	dired-listing-switches "-AGFhlv --group-directories-first --time-style=long-iso"
  	openwith-associations '(
  				("\\.pdf\\'" "zathura" (file)))))
#+end_src
*** Open With
Allows for opening certain file extensions in programs other than emacs 😱--mainly pdfs
#+begin_src emacs-lisp
  (use-package openwith
    :straight t
    :after dired)
#+end_src
** Denote
#+begin_src emacs-lisp
  (use-package denote
    :straight t
    :config (setq denote-directory "/home/cleinz/Nextcloud/Documents/Notes"))
#+end_src
* Editing
** EViL
Evil editing--accept no substitute
#+begin_src emacs-lisp
  (use-package evil
    :straight t
    :init
    (setq evil-want-keybinding nil)
    :config
    (setq evil-want-integration t
  	evil-vsplit-window-right t
  	evil-auto-indent t
  	evil-split-window-below t)
    (evil-mode)
    (define-key evil-normal-state-map (kbd "C-u") 'evil-scroll-up)
    (evil-set-undo-system 'undo-redo))
#+end_src
*** EViL Collections
Adds evil-style keybindings for a bunch of major-modes
#+begin_src emacs-lisp
  (use-package evil-collection
    :straight t
    :after evil
    :config
    (evil-collection-init))
#+end_src
*** EViL Comments
Allows for simple selection-based commenting/uncommenting
#+begin_src emacs-lisp
  (use-package evil-nerd-commenter
    :straight t
    :after evil)
#+end_src
*** EViL Multi-Cursor
Allows for the creation of multiple cursors for editing
#+begin_src emacs-lisp
  (use-package evil-mc
    :straight t
    :after evil
    :config
    (setq evil-mc-mode-line-text-cursor-color t)
    (global-evil-mc-mode 1))
#+end_src
*** EViL Surround
Adds the ability to add delimiters to the outside of a selection

I customize this because the default behavior is to have a space between the delimiters if you use the opening version of the paren, and no-space if you use the closing paren. I prefer the opposite behavior
#+begin_src emacs-lisp
  (use-package evil-surround
    :straight t
    :after evil
    :config
    (global-evil-surround-mode 1)
    (setq-default evil-surround-pairs-alist
  		'(
  		  (?\( . ("(" . ")"))
  		  (?\< . ("<" . ">"))
  		  (?\[ . ("[" . "]"))
  		  (?\{ . ("{" . "}"))
  		  (?\) . ("( " . " )"))
  		  (?\> . ("< " . " >"))
  		  (?\] . ("[ " . " ]"))
  		  (?\} . ("{ " . " }"))
  		  (?\` . ("`" . "`"))
  		  ))
    )
#+end_src
** Avy
#+begin_src emacs-lisp
  (use-package avy
    :straight t
    :config
    (setq avy-all-windows t))
#+end_src
** Minbuffer
*** Vertico
#+begin_src emacs-lisp
  (use-package vertico
    :straight t
    :hook (after-init . vertico-mode)
    :config
    (setq vertico-cycle t
  	vertico-count 10))
#+end_src
*** Orderless
Allows filtering on fuzzy matches "foo baz" will find "foo-bar-baz"
#+begin_src emacs-lisp
  (use-package orderless
    :straight t
    :config
    (setq completion-styles '(orderless basic)
          completion-category-defaults nil
  	read-buffer-completion-ignore-case t))
#+end_src
*** Marginalia
Adds additional information to minibuffer results
#+begin_src emacs-lisp
  (use-package marginalia
    :straight t
    :hook
    (after-init . marginalia-mode))
#+end_src
** Completion
For completion-at-point I like company mode. I tried very hard to use [[https://github.com/minad/corfu][corfu]], it just seemed to cause emacs to crash occasionally in conjunction with lsp-mode and so I went back to company.
#+begin_src emacs-lisp
  (use-package company
    :straight t
    :config
    (setq company-idle-delay 0.2 
  	company-minimum-prefix-length 2
  	company-tooltip-align-annotations t
  	company-tooltip-limit 5
  	company-tooltip-minimum 5
  	company-tooltip-offset-display 'lines
  	company-format-margin-function 'company-vscode-dark-icons-margin)
    :bind
    (:map company-active-map
  	("<tab>" . company-complete-selection)
  	("C-n" . company-select-next)
  	("C-p" . company-select-previous)
  	("M-<" . company-select-first)
  	("M->" . company-select-last))
    :hook (after-init . global-company-mode)
    )
#+end_src
*** Cape
Adds additional collections to the completion at point like file paths and emojis
#+begin_src emacs-lisp
  (use-package cape
    :straight t
    :bind ("C-c f" . cape-file)
    :init
    (add-hook 'completion-at-point-functions #'cape-file)
    (add-hook 'completion-at-point-functions #'cape-emoji)
    :config
    ;; Silence then pcomplete capf, no errors or messages!
    (advice-add 'pcomplete-completions-at-point :around #'cape-wrap-silent)
    ;; Ensure that pcomplete does not write to the buffer
    ;; and behaves as a pure `completion-at-point-function'.
    (advice-add 'pcomplete-completions-at-point :around #'cape-wrap-purify))
#+end_src
** Consult
Consult adds a ton of useful commands that improve on existing emacs functionality like ~consult-buffer~ which shows a live preview of the buffer as you move through the options, or ~consult-theme~ which does a similar thing. Must-have
#+begin_src emacs-lisp
  (use-package consult
    :straight t)
#+end_src
*** Denote
#+begin_src emacs-lisp
  (use-package consult-denote
    :straight t
    :after denote)
#+end_src
*** LSP
#+begin_src emacs-lisp
  (use-package consult-denote
    :straight t
    :after denote)
*** Flycheck
#+begin_src emacs-lisp
  (use-package consult-flycheck
    :straight t
    :after flycheck)
#+end_src
*** Todo
#+begin_src emacs-lisp
  (use-package consult-todo
    :straight t
    :after hl-todo)
#+end_src
** Highlight Todo
Highlights terms like NOTE and TODO
#+begin_src emacs-lisp
  (use-package hl-todo
    :straight t
    :hook (after-init . global-hl-todo-mode))
#+end_src
** Ripgrep
#+begin_src emacs-lisp
  (use-package rg
    :straight t)
#+end_src
