init.el
(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(load custom-file :no-error-if-file-is-missing)

(setq backup-directory-alist
      '((".*" . "~/.emacs.d/backups/")))

(use-package savehist
  :config
  (savehist-mode))

(recentf-mode 1)

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name
        "straight/repos/straight.el/bootstrap.el"
        (or (bound-and-true-p straight-base-dir)
            user-emacs-directory)))
      (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(straight-use-package 'use-package)

(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(setq-default inhibit-splash-screen t)
(setq-default cursor-type 'bar)

(add-to-list 'display-buffer-alist
             '("\\`\\*\\(Warnings\\|Compile-Log\\)\\*\\'"
               (display-buffer-no-window)
               (allow-no-window . t)))

(set-face-attribute 'default nil :font "ComicShannsMono Nerd Font Mono" :height 120)

(pixel-scroll-precision-mode 1)
(setq scroll-margin 5
      scroll-step 1
      scroll-conservatively 10000
      scroll-preserve-screen-position 1)

(setq display-line-numbers-type 'relative)

(use-package doom-modeline
  :straight t
  :after nerd-icons
  :init
  (doom-modeline-mode 1)
  (display-time-mode t)
  :config
  (setq doom-modeline-project-detection 'auto
	       doom-modeline-icon t
	       doom-modeline-analogue-clock nil
	       doom-modeline-lsp-icon t
	       doom-modeline-modal t
	       doom-modeline-modal-modern-icon t))

(use-package ef-themes
  :straight t
  :config
  (setq ef-themes-to-toggle '(ef-autumn ef-melissa-light))
  (ef-themes-select 'ef-autumn))

(use-package catppuccin-theme
  :straight t
  :defer t)

(use-package cyberpunk-theme
  :straight t
  :defer t)

(use-package doom-themes
  :straight t
  :defer t)

(use-package gruber-darker-theme
  :straight t
  :defer t)

(use-package nerd-icons
  :straight t
  :config
  (setq nerd-icons-scale-factor 1.1
	nerd-icons-font-family "ComicShannsMono Nerd Font Mono"))

(use-package nerd-icons-completion
  :straight t
  :after (nerd-icons marginalia)
  :config
  (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup))

(use-package nerd-icons-dired
  :straight t
  :after nerd-icons
  :hook
  (dired-mode . nerd-icons-dired-mode))

(use-package dired
  :hook
  (dired-mode . openwith-mode)
  :config
  (setq dired-auto-revert-buffer #'dired-directory-changed-p
	dired-free-space nil
	dired-listing-switches "-AGFhlv --group-directories-first --time-style=long-iso"
	openwith-associations '(
				("\\.pdf\\'" "zathura" (file)))))

(use-package openwith
  :straight t
  :after dired)

(use-package evil
  :straight t
  :init
  (setq evil-want-keybinding nil)
  :config
  (setq evil-want-integration t
	evil-vsplit-window-right t
	evil-auto-indent t
	evil-split-window-below t)
  (evil-mode)
  (define-key evil-normal-state-map (kbd "C-u") 'evil-scroll-up)
  (evil-set-undo-system 'undo-redo))

(use-package evil-collection
  :straight t
  :after evil
  :config
  (evil-collection-init))

(use-package evil-nerd-commenter
  :straight t
  :after evil)

(use-package evil-mc
  :straight t
  :after evil
  :config
  (setq evil-mc-mode-line-text-cursor-color t)
  (global-evil-mc-mode 1))

(use-package evil-surround
  :straight t
  :after evil
  :config
  (global-evil-surround-mode 1)
  (setq-default evil-surround-pairs-alist
		'(
		  (?\( . ("(" . ")"))
		  (?\< . ("<" . ">"))
		  (?\[ . ("[" . "]"))
		  (?\{ . ("{" . "}"))
		  (?\) . ("( " . " )"))
		  (?\> . ("< " . " >"))
		  (?\] . ("[ " . " ]"))
		  (?\} . ("{ " . " }"))
		  (?\` . ("`" . "`"))
		  ))
  )

(use-package avy
  :straight t
  :config
  (setq avy-all-windows t))

(use-package vertico
  :straight t
  :hook (after-init . vertico-mode)
  :config
  (setq vertico-cycle t
	vertico-count 10))

(use-package orderless
  :straight t
  :config
  (setq completion-styles '(orderless basic)
        completion-category-defaults nil
	read-buffer-completion-ignore-case t))

(use-package marginalia
  :straight t
  :hook
  (after-init . marginalia-mode))

(use-package company
  :straight t
  :config
  (setq company-idle-delay 0.2 
	company-minimum-prefix-length 2
	company-tooltip-align-annotations t
	company-tooltip-limit 5
	company-tooltip-minimum 5
	company-tooltip-offset-display 'lines
	company-format-margin-function 'company-vscode-dark-icons-margin)
  :bind
  (:map company-active-map
	("<tab>" . company-complete-selection)
	("C-n" . company-select-next)
	("C-p" . company-select-previous)
	("M-<" . company-select-first)
	("M->" . company-select-last))
  :hook (after-init . global-company-mode)
  )

(use-package cape
  :straight t
  :bind ("C-c f" . cape-file)
  :init
  (add-hook 'completion-at-point-functions #'cape-file)
  (add-hook 'completion-at-point-functions #'cape-emoji)
  :config
  ;; Silence then pcomplete capf, no errors or messages!
  (advice-add 'pcomplete-completions-at-point :around #'cape-wrap-silent)
  ;; Ensure that pcomplete does not write to the buffer
  ;; and behaves as a pure `completion-at-point-function'.
  (advice-add 'pcomplete-completions-at-point :around #'cape-wrap-purify))

(use-package consult
  :straight t)

(use-package consult-denote
  :straight t
  :after denote)

(use-package consult-denote
  :straight t
  :after denote)

(use-package consult-todo
  :straight t
  :after hl-todo)

(use-package hl-todo
  :straight t
  :hook (after-init . global-hl-todo-mode))
