README.org
* Programming
#+begin_src emacs-lisp
  (use-package prog-mode
    :config (setq truncate-lines nil)
    :hook
    (prog-mode . (lambda ()
  		 (flyspell-prog-mode)
  		 (display-line-numbers-mode)
  		 (display-fill-column-indicator-mode)
  		 (electric-indent-mode)
  		 (electric-pair-mode))))
#+end_src
** LSP
#+begin_src emacs-lisp
  (use-package lsp-mode
    :straight t
    :commands lsp
    :config
    (setq lsp-diagnostics-flycheck-enable t
  	lsp-keymap-prefix "C-l"
  	lsp-headerline-breadcrumb-enable nil
  	lsp-idle-delay 0.5))
#+end_src
** Flycheck
#+begin_src emacs-lisp
  (use-package flycheck
    :straight t
    :config
    (add-hook 'after-init-hook #'global-flycheck-mode))
#+end_src
** Treesitter
#+begin_src emacs-lisp
  (use-package tree-sitter
    :straight t
    :config (global-tree-sitter-mode))
#+end_src
*** Collection 
#+begin_src emacs-lisp
  (use-package tree-sitter-langs
    :straight t)
#+end_src
** Colors
#+begin_src emacs-lisp
  (use-package colorful-mode
    :straight t 
    :hook (prog-mode text-mode))
#+end_src
** Direnv
Direnv integration, automatically reads ~.envrc~ files and loads the proper environment for a given buffer. Great for Nix and python
#+begin_src emacs-lisp
  (use-package direnv
    :straight t
    :config
    (direnv-mode)) 
#+end_src
** Documentation
Useful for browsing documentation within emacs
#+begin_src emacs-lisp
  (use-package devdocs
    :straight t)
#+end_src
** Formatting
Great asynchronous code formatter
#+begin_src emacs-lisp
  (use-package apheleia
    :straight t
    :config
    (add-to-list 'apheleia-formatters '(rustfmt . ("rustfmt" "--quiet" "--emit" "stdout" "--edition" "2024")))
    :hook (prog-mode . apheleia-mode))
#+end_src
** Rainbow Delimiters
#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :straight t
    :defer t)
#+end_src
** Compilation
Customizations to the default compile mode in emacs
#+begin_src emacs-lisp
  (use-package compile
    :config
    (setq compilation-scroll-output t))
#+end_src
*** Fancy Compilation
[[https://codeberg.org/ideasman42/emacs-fancy-compilation][fancy-compilation]] adds color support
#+begin_src emacs-lisp
  (use-package fancy-compilation
    :straight t
    :after compile
    :commands (fancy-compilation-mode)
    :config
    (setq fancy-compilation-override-colors nil)
    :init
    (with-eval-after-load 'compile
      (fancy-compilation-mode)))
#+end_src
** Vterm
#+begin_src emacs-lisp
  (use-package vterm
    :straight t
    :config
    (setq vterm-shell "nu"))
#+end_src
*** Multi-Vterm
Allows creating multiple vterm windows easily
#+begin_src emacs-lisp
  (use-package multi-vterm
    :straight t
    :after vterm)
#+end_src
** Version Control
*** Magit
#+begin_src emacs-lisp
  (use-package magit
    :straight t
    :after seq
    :config
    (with-eval-after-load 'magit-mode
      (add-hook 'after-save-hook 'magit-after-save-refresh-status t))
    (setopt magit-format-file-function #'magit-format-file-nerd-icons)
    (setq magit-show-long-lines-warning nil))
#+end_src
**** Todos
Highlight todos in the project in the magit-status buffer
#+begin_src emacs-lisp
  (use-package magit-todos
    :straight t
    :after magit
    :config
    (magit-todos-mode 1))
#+end_src
*** Modes
#+begin_src emacs-lisp
  (use-package git-modes
    :straight t)
#+end_src
*** Ediff
The default ediff settings are kind of annoying, these improve them
#+begin_src emacs-lisp
  (use-package ediff
    :config
    (setq ediff-split-window-function 'split-window-horizontally)
    (setq ediff-window-setup-function 'ediff-setup-windows-plain))
#+end_src
*** Highlight Diffs
Shows highlights in the gutter for whether changes have been committed to VC files
#+begin_src emacs-lisp
  (use-package diff-hl
    :straight t
    :config
    (diff-hl-dired-mode t)
    :hook
    (prog-mode . diff-hl-mode)
    (magit-pre-refresh . diff-hl-magit-pre-refresh)
    (magit-post-refresh . diff-hl-magit-post-refresh))
#+end_src
*** Blamer
Adds git-blame to the buffer. In general this is too noisy for my taste but I like to be able to toggle it on for the times where I do want it
#+begin_src emacs-lisp
  (use-package blamer
    :straight t
    :defer t
    :config
    (setq blamer-idle-time 0.3
  	blamer-view 'overlay-right)
    :custom-face
    (blamer-face ((t :foreground "#484741"
                     :background unspecified
                     :height 120
                     :italic t))))
#+end_src
** Languages
*** Docker
#+begin_src emacs-lisp
  (use-package dockerfile-mode
    :straight t
    :mode ("\\.Dockerfile\\'" "Dockerfile")
    :hook
    (dockerfile-mode . (lambda () (setq-local devdocs-current-docs '("docker")))))
#+end_src
*** Groovy
#+begin_src emacs-lisp
  (use-package groovy-mode
    :straight t
    :config
    (setq groovy-indent-offset 2))
#+end_src
*** Odin
#+begin_src emacs-lisp
  (use-package odin-mode
    :straight (:type git :repo "https://git.sr.ht/~mgmarlow/odin-mode"))
#+end_src
*** Protobuf
#+begin_src emacs-lisp
  (use-package protobuf-mode
    :straight t)
#+end_src
*** Java
#+begin_src emacs-lisp
  (use-package java-ts-mode
    :mode ("\\.java\\'")
    :hook
    (java-ts-mode . (lambda () (setq-local devdocs-current-docs '("openjdk~21")))))
#+end_src
*** JSON
#+begin_src emacs-lisp
  (use-package json-ts-mode
    :mode ("\\.json\\'" . json-ts-mode))
#+end_src
*** Justfile
#+begin_src emacs-lisp
  (use-package just-mode
    :straight t)
#+end_src
*** Makefile
#+begin_src emacs-lisp
  (use-package makefile-mode
    :hook
    (makefile-mode . (lambda () (setq-local devdocs-current-docs '("gnu_make")))))
#+end_src
*** Markdown
#+begin_src emacs-lisp
  (use-package markdown-mode
    :config
    (setq indent-tabs-mode nil)
    :hook
    (markdown-mode . (lambda () (setq-local devdocs-current-docs '("markdown")))))
#+end_src
*** Nix
#+begin_src emacs-lisp
  (use-package nix-mode
    :straight t
    :mode "\\.nix\\'"
    :hook
    (nix-mode . (lambda () (setq-local devdocs-current-docs '("nix")))))
#+end_src
*** Nushell
#+begin_src emacs-lisp
  (use-package nushell-mode
    :straight t
    :hook
    (nushell-mode . (lambda () (setq-local devdocs-current-docs '("nushell")))))
#+end_src
*** Python
#+begin_src emacs-lisp
  (use-package python-mode
    :straight t
    :hook
    (python-mode . (lambda () (setq-local devdocs-current-docs '("python~3.13")))))
#+end_src
*** Re-Structured Text
#+begin_src emacs-lisp
  (use-package rst
    :hook ((rst-mode . eglot-ensure)
  	 (rst-mode . display-line-numbers-mode)
  	 (rst-mode . display-fill-column-indicator-mode)
  	 (rst-mode . (lambda () (set-fill-column 80))))
    :config
    (setq-local compilation-ask-about-save nil)
    (setq compile-command "make -k")
    (with-eval-after-load
        'eglot (add-to-list
  	      'eglot-server-programs
  	      '(rst-mode . ("esbonio")))
        )
    )
#+end_src
*** Rust
#+begin_src emacs-lisp
  (use-package rust-ts-mode
    :mode ("\\.rs\\'" . rust-ts-mode)
    :hook ((rust-ts-mode . lsp-deferred)
  	 (rust-ts-mode . (lambda () (set-fill-column 100)))
  	 (rust-ts-mode . (lambda () (setq-local devdocs-current-docs '("rust")))))
    :config
    (setq compile-command "cargo b --all-features")
    (setq lsp-rust-analyzer-cargo-watch-command "clippy")
    (setq lsp-rust-features "all"))
#+end_src
**** Cargo
#+begin_src emacs-lisp
  (use-package cargo
    :straight t)
#+end_src
*** Toml
#+begin_src emacs-lisp
  (use-package toml-ts-mode
    :mode ("\\.toml\\'" "Cargo\\.lock\\'"))
#+end_src
*** Yaml
#+begin_src emacs-lisp
  (use-package yaml-ts-mode
    :mode ("\\.yml\\'" "\\.yaml\\'"))
#+end_src
*** Zig
#+begin_src emacs-lisp
  (use-package zig-mode
    :straight t
    :hook
    (zig-mode . (lambda () (setq-local devdocs-current-docs '("zig")))))
#+end_src

* Org Mode
#+begin_src emacs-lisp
  (use-package org
    :straight t
    :hook
    (org-mode . (lambda ()
  		(visual-line-mode)
  		(flyspell-mode)
  		(display-line-numbers-mode)
  		(org-superstar-mode)
  		(org-indent-mode)))
    :config
    (setq org-todo-keywords
          '((sequence "TODO(t)" "PROG(p)" "PROJ(j)" "SENT(s)" "|" "DONE(d)" "CANC(c)" "PASS(a)")))
    (setq org-todo-keyword-faces
          '(("TODO" . "#ff5555") ("PROG" . "#ffb86c") ("PROJ" . "#8be9fd") ("SENT" . "#ff79c6")
            ("DONE" . "#50fa7b") ("CANC" . "#a4fcba") ("PASS" . "#44475a")))
    ;; Add these files to the agenda
    (setq org-clock-sound (expand-file-name "timer.wav" user-emacs-directory)
  	org-agenda-files '("~/Notes/day-book.org")
  	org-src-fontify-natively t)
    ;; Save Org buffers after refiling!
    (advice-add 'org-refile :after 'org-save-all-org-buffers))
#+end_src
** Org Superstar
Eye-candy for org-mode
#+begin_src emacs-lisp
  (use-package org-superstar
    :straight t
    :after org
    :config
    (setq org-hide-leading-stars nil)
    ;; This line is necessary.
    (setq org-superstar-leading-bullet ?\s)
    ;; If you use Org Indent you also need to add this, otherwise the
    ;; above has no effect while Indent is enabled.
    (setq org-indent-mode-turns-on-hiding-stars nil))
#+end_src
* Keybindings
** Which Key
Helpful popups with descriptions of what each key in the map does
#+begin_src emacs-lisp
  (use-package which-key
    :straight t
    :defer t
    :config
    (setq which-key-idle-delay 0.5)
    (which-key-mode))
#+end_src
