init.el

(use-package prog-mode
  :config (setq truncate-lines nil)
  :hook
  (prog-mode . (lambda ()
		 (flyspell-prog-mode)
		 (display-line-numbers-mode)
		 (display-fill-column-indicator-mode)
		 (electric-indent-mode)
		 (electric-pair-mode))))

(use-package lsp-mode
  :straight t
  :commands lsp
  :config
  (setq lsp-diagnostics-flycheck-enable t
	lsp-keymap-prefix "C-l"
	lsp-headerline-breadcrumb-enable nil
	lsp-idle-delay 0.5))

(use-package tree-sitter
  :straight t
  :config (global-tree-sitter-mode))

(use-package tree-sitter-langs
  :straight t)

(use-package colorful-mode
  :straight t 
  :hook (prog-mode text-mode))

(use-package direnv
  :straight t
  :config
  (direnv-mode))

(use-package devdocs
  :straight t)

(use-package apheleia
  :straight t
  :config
  (add-to-list 'apheleia-formatters '(rustfmt . ("rustfmt" "--quiet" "--emit" "stdout" "--edition" "2024")))
  :hook (prog-mode . apheleia-mode))

(use-package rainbow-delimiters
  :straight t
  :defer t)

(use-package compile
  :config
  (setq compilation-scroll-output t))

(use-package fancy-compilation
  :straight t
  :after compile
  :commands (fancy-compilation-mode)
  :config
  (setq fancy-compilation-override-colors nil)
  :init
  (with-eval-after-load 'compile
    (fancy-compilation-mode)))

(use-package vterm
  :straight t
  :config
  (setq vterm-shell "nu"))

(use-package multi-vterm
  :straight t
  :after vterm)

(use-package magit
  :straight t
  :after seq
  :config
  (with-eval-after-load 'magit-mode
    (add-hook 'after-save-hook 'magit-after-save-refresh-status t))
  (setopt magit-format-file-function #'magit-format-file-nerd-icons)
  (setq magit-show-long-lines-warning nil))

(use-package magit-todos
  :straight t
  :after magit
  :config
  (magit-todos-mode 1))

(use-package git-modes
  :straight t)

(use-package ediff
  :config
  (setq ediff-split-window-function 'split-window-horizontally)
  (setq ediff-window-setup-function 'ediff-setup-windows-plain))

(use-package diff-hl
  :straight t
  :config
  (diff-hl-dired-mode t)
  :hook
  (prog-mode . diff-hl-mode)
  (magit-pre-refresh . diff-hl-magit-pre-refresh)
  (magit-post-refresh . diff-hl-magit-post-refresh))

(use-package blamer
  :straight t
  :defer t
  :config
  (setq blamer-idle-time 0.3
	blamer-view 'overlay-right)
  :custom-face
  (blamer-face ((t :foreground "#484741"
                   :background unspecified
                   :height 120
                   :italic t))))

(use-package dockerfile-mode
  :straight t
  :mode ("\\.Dockerfile\\'" "Dockerfile")
  :hook
  (dockerfile-mode . (lambda () (setq-local devdocs-current-docs '("docker")))))

(use-package groovy-mode
  :straight t
  :config
  (setq groovy-indent-offset 2))

(use-package odin-mode
  :straight (:type git :repo "https://git.sr.ht/~mgmarlow/odin-mode"))

(use-package java-ts-mode
  :mode ("\\.java\\'")
  :hook
  (java-ts-mode . (lambda () (setq-local devdocs-current-docs '("openjdk~21")))))

(use-package json-ts-mode
  :mode ("\\.json\\'" . json-ts-mode))

(use-package just-mode
  :straight t)

(use-package makefile-mode
  :hook
  (makefile-mode . (lambda () (setq-local devdocs-current-docs '("gnu_make")))))

(use-package markdown-mode
  :config
  (setq indent-tabs-mode nil)
  :hook
  (markdown-mode . (lambda () (setq-local devdocs-current-docs '("markdown")))))

(use-package nix-mode
  :straight t
  :mode "\\.nix\\'"
  :hook
  (nix-mode . (lambda () (setq-local devdocs-current-docs '("nix")))))

(use-package nushell-mode
  :straight t
  :hook
  (nushell-mode . (lambda () (setq-local devdocs-current-docs '("nushell")))))

(use-package python-mode
  :straight t
  :hook
  (python-mode . (lambda () (setq-local devdocs-current-docs '("python~3.13")))))

(use-package rst
  :hook ((rst-mode . eglot-ensure)
	 (rst-mode . display-line-numbers-mode)
	 (rst-mode . display-fill-column-indicator-mode)
	 (rst-mode . (lambda () (set-fill-column 80)))
	 (rst-mode . flymake-mode))
  :config
  (setq-local compilation-ask-about-save nil)
  (setq compile-command "make -k")
  (with-eval-after-load
      'eglot (add-to-list
	      'eglot-server-programs
	      '(rst-mode . ("esbonio")))
      )
  )

(use-package rust-ts-mode
  :mode ("\\.rs\\'" . rust-ts-mode)
  :hook ((rust-ts-mode . lsp-deferred)
	 (rust-ts-mode . (lambda () (set-fill-column 100)))
	 (rust-ts-mode . (lambda () (setq-local devdocs-current-docs '("rust")))))
  :config
  (setq compile-command "cargo b --all-features")
  (setq lsp-rust-analyzer-cargo-watch-command "clippy")
  (setq lsp-rust-features "all"))

(use-package cargo
  :straight t)

(use-package toml-ts-mode
  :mode ("\\.toml\\'" "Cargo\\.lock\\'"))

(use-package yaml-ts-mode
  :mode ("\\.yml\\'" "\\.yaml\\'"))

(use-package zig-mode
  :straight t
  :hook
  (zig-mode . (lambda () (setq-local devdocs-current-docs '("zig")))))

(use-package org
  :straight t
  :hook
  (org-mode . (lambda ()
		(visual-line-mode)
		(flyspell-mode)
		(display-line-numbers-mode)
		(org-superstar-mode)
		(org-indent-mode)
		(yas-minor-mode)))
  :config
  (setq org-todo-keywords
        '((sequence "TODO(t)" "PROG(p)" "PROJ(j)" "SENT(s)" "|" "DONE(d)" "CANC(c)" "PASS(a)")))
  (setq org-todo-keyword-faces
        '(("TODO" . "#ff5555") ("PROG" . "#ffb86c") ("PROJ" . "#8be9fd") ("SENT" . "#ff79c6")
          ("DONE" . "#50fa7b") ("CANC" . "#a4fcba") ("PASS" . "#44475a")))
  ;; Add these files to the agenda
  (setq org-clock-sound (expand-file-name "timer.wav" user-emacs-directory)
	org-agenda-files '("~/Notes/day-book.org")
	org-src-fontify-natively t)
  ;; Save Org buffers after refiling!
  (advice-add 'org-refile :after 'org-save-all-org-buffers))

(use-package org-superstar
  :straight t
  :after org
  :config
  (setq org-hide-leading-stars nil)
  ;; This line is necessary.
  (setq org-superstar-leading-bullet ?\s)
  ;; If you use Org Indent you also need to add this, otherwise the
  ;; above has no effect while Indent is enabled.
  (setq org-indent-mode-turns-on-hiding-stars nil))

(use-package which-key
  :straight t
  :defer t
  :config
  (setq which-key-idle-delay 0.5)
  (which-key-mode))
